########
# Taps #
########

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

############
# Formulas #
############

brew "bat"
brew "python@3.9"
brew "glib"
brew "composer"
brew "dnsmasq", restart_service: true
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "unbound"
brew "gnupg"
brew "gotop"
brew "httpie"
brew "krb5"
brew "lsd"
brew "mailhog", restart_service: true
brew "mas"
brew "minikube"
brew "ncdu"
brew "neovim"
brew "nginx", restart_service: true
brew "node"
brew "pandoc"
brew "php", restart_service: true
brew "poetry"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "rust"
brew "stow"
brew "subversion"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "vips"
brew "yarn"
brew "zsh"

#########
# Casks #
#########

cask "anaconda"
cask "basictex"
cask "firefox"
cask "font-epilogue"
cask "font-inter"
cask "font-lobster"
cask "font-prompt"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "slack"
cask "sublime-text"
cask "visual-studio-code"

#################
# Mac App Store #
#################

mas "Amphetamine", id: 937984704
mas "Focus To-Do", id: 1258530160
mas "Magnet", id: 441258766
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
